
## Plan Result




<pre><code>Plan: 3 to add, 7 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_connection_string
  * module.redis-ccd.azurerm_redis_cache.redis
  * module.redis-ccd.azurerm_resource_group.cache-resourcegroup
* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.dm_store_storage_account.azurerm_storage_account.storage_account
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.storage_account.azurerm_storage_account.storage_account
  * module.vault.azurerm_key_vault.kv
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Insights/components/ccd-aat"
        name                                  = "ccd-aat"
      ~ tags                                  = {
          ~ "contactSlackChannel" = "#ccd-questions-answers" -> "#ccd-community"
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.redis_connection_string will be created
  + resource "azurerm_key_vault_secret" "redis_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat"
      + name                    = "ccd-redis-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat"
        name     = "ccd-shared-aat"
      ~ tags     = {
          ~ "contactSlackChannel" = "#ccd-questions-answers" -> "#ccd-community"
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.dm_store_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Storage/storageAccounts/dmstoredocaat"
        name                              = "dmstoredocaat"
      ~ tags                              = {
          - "Deployment Environment" = "aat" -> null
            # (9 unchanged elements hidden)
        }
        # (36 unchanged attributes hidden)

      - timeouts {}

        # (4 unchanged blocks hidden)
    }

  # module.redis-ccd.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "ccd-redis-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "ccd-redis-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "application"         = "core-case-data"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "staging"
          + "managedBy"           = "CCD"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 300
          + maxmemory_delta                 = 200
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 200
        }
    }

  # module.redis-ccd.azurerm_resource_group.cache-resourcegroup will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ccd-redis-cache-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "application"         = "core-case-data"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "staging"
          + "managedBy"           = "CCD"
        }
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.ServiceBus/namespaces/ccd-servicebus-aat"
        name                                = "ccd-servicebus-aat"
      ~ tags                                = {
          ~ "contactSlackChannel" = "#ccd-questions-answers" -> "#ccd-community"
            # (8 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

      - timeouts {}
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Storage/storageAccounts/ccdsharedaat"
        name                              = "ccdsharedaat"
      ~ tags                              = {
          - "Deployment Environment" = "aat" -> null
          ~ "contactSlackChannel"    = "#ccd-questions-answers" -> "#ccd-community"
            # (8 unchanged elements hidden)
        }
        # (36 unchanged attributes hidden)

      - timeouts {}

        # (4 unchanged blocks hidden)
    }

  # module.vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat"
        name                            = "ccd-aat"
      ~ tags                            = {
          ~ "contactSlackChannel" = "#ccd-questions-answers" -> "#ccd-community"
            # (8 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

      - timeouts {}

        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat|ccd-aat"
        name                       = "ccd-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 7 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":160,"Program":"tfcmt","SHA1":"","Vars":{}} -->